pandas

In [1]:
import pandas as pd

*Series ----- 1d array
*Data Frame ------- 2d array (Table format,row & col)

In [2]:
a=pd.Series([])
b=pd.Series([1,2,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10,'b':15,'c':56,'d':99})

/var/folders/60/4fcfkyvn6wd0wctsgj7stzsc0000gn/T/ipykernel_37537/3292576525.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [6]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [7]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [8]:
import numpy as np

In [9]:
n=np.array([1,2,3,4,40])

In [10]:
x=pd.series(n)

AttributeError: module 'pandas' has no attribute 'series'

In [ ]:
x

In [ ]:
pd.series([1,2,[11,10],33,[12,23],47,58,100])

In [16]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [15]:
n=pd.array([1,2,3,4])

In [12]:
n

<IntegerArray>
[1, 2, 3, 4]
Length: 4, dtype: Int64

In [17]:
b[3:7]

3     47
4     58
5    100
dtype: int64

In [20]:
b[2]

33

In [21]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [22]:
d['d']

99

In [23]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [25]:
s = pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [26]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [38]:
s1=pd.Series([12,43,34,23,53,25,64])

In [39]:
s1

0    12
1    43
2    34
3    23
4    53
5    25
6    64
dtype: int64

In [30]:
s2=pd.Series([12,52,12,52,10,23,42,10,23])

In [31]:
s2.value_counts()

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [ ]:
type(x)

#data frame

In [40]:
a = pd.DataFrame()
b = pd.DataFrame([1,2,55,40,86])

In [41]:
a

Empty DataFrame
Columns: []
Index: []

In [42]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [48]:
c=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [49]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [73]:
c=pd.DataFrame([[34,32,12,53],[23,64,43,21],[53,64,73,62],[93,83,15,19],[31,53,12,14],[43,66,44,22]],columns=['colA','colB','colC','colD'])

In [74]:
c

   colA  colB  colC  colD
0    34    32    12    53
1    23    64    43    21
2    53    64    73    62
3    93    83    15    19
4    31    53    12    14
5    43    66    44    22

In [57]:
c.tail(3)

    0   1   2   3
3  93  83  15  19
4  31  53  12  14
5  43  66  44  22

In [58]:
c.sample(5)

    0   1   2   3
0  34  32  12  53
4  31  53  12  14
2  53  64  73  62
5  43  66  44  22
1  23  64  43  21

In [75]:
c['colB']

0    32
1    64
2    64
3    83
4    53
5    66
Name: colB, dtype: int64

In [79]:
c[['colC','colB']]

   colC  colB
1    43    64
2    73    64
3    15    83

In [81]:
c.shape

(6, 4)

In [93]:
c['new_col']=[11,22,33,44,55,66]

In [94]:
c

   colA  colB  colC  colD new_col
0    34    32    12    53      11
1    23    64    43    21      22
2    53    64    73    62      33
3    93    83    15    19      44
4    31    53    12    14     Nah
5    43    66    44    22      66

In [97]:
c['add']=c['colC']+c['colD']

In [98]:
c

   colA  colB  colC  colD new_col  add
0    34    32    12    53      11   65
1    23    64    43    21      22   64
2    53    64    73    62      33  135
3    93    83    15    19      44   34
4    31    53    12    14     Nah   26
5    43    66    44    22      66   66

In [99]:
c['colD']>50

0     True
1    False
2     True
3    False
4    False
5    False
Name: colD, dtype: bool

In [101]:
f

0    False
1     True
2     True
3    False
4    False
5     True
Name: colC, dtype: bool